In [1]:
#! pip install -r ../requirements.txt

In [2]:
import pandas as pd

In [3]:
links = pd.read_csv('../data/links.csv', index_col='movieId') # ids do filme y nas plataformas imdb e tmdb, util para enriquecer os dados
movies = pd.read_csv('../data/movies_m100_u10.csv', index_col='movieId') # dados do filme y
ratings = pd.read_csv('../data/ratings_m100_u10.csv', index_col='movieId') # avaliacao do usuario x pro filme y
tags = pd.read_csv('../data/tags.csv', index_col='movieId') # n parece mto relevante

In [4]:
links.head()

         imdbId   tmdbId
movieId
1        114709    862.0
2        113497   8844.0
3        113228  15602.0
4        114885  31357.0
5        113041  11862.0

In [5]:
movies.head()

,title,genres
movieId,,
1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
2,Jumanji (1995),Adventure|Children|Fantasy
6,Heat (1995),Action|Crime|Thriller
10,GoldenEye (1995),Action|Adventure|Thriller
32,Twelve Monkeys (a.k.a. 12 Monkeys) (1995),Mystery|Sci-Fi|Thriller

In [6]:
ratings.head()

         Unnamed: 0  userId  rating  timestamp
movieId
1                 0       1     4.0  964982703
6                 2       1     4.0  964982224
47                3       1     5.0  964983815
50                4       1     5.0  964982931
110               7       1     4.0  964982176

In [7]:
tags.head()

         userId              tag   timestamp
movieId
60756         2            funny  1445714994
60756         2  Highly quotable  1445714996
60756         2     will ferrell  1445714992
89774         2     Boxing story  1445715207
89774         2              MMA  1445715200